In [1]:
import numpy as np
import pandas as pd

Series / Seriler

In [2]:
benimSozlugum  = {"emre":40,"eren":30, "arda":20}

In [3]:
pd.Series(benimSozlugum)

emre    40
eren    30
arda    20
dtype: int64

In [4]:
benimYaslarim = [50,40,30]
benimIsimlerim = ["emre","eren","arda"]

In [5]:
pd.Series(benimYaslarim, benimIsimlerim)

emre    50
eren    40
arda    30
dtype: int64

In [6]:
pd.Series(data=benimYaslarim, index=benimIsimlerim)

emre    50
eren    40
arda    30
dtype: int64

In [7]:
pd.Series(["emre","eren","arda"],[1,2,3]) #default indexleri ayarlamak için kullanılır

1    emre
2    eren
3    arda
dtype: object

In [8]:
yarismaSonucu1 = pd.Series([10,9,1],["emre","eren","arda"])
yarismaSonucu1

emre    10
eren     9
arda     1
dtype: int64

In [9]:
yarismaSonucu2 = pd.Series([100,90,12],["emre","eren","arda"])

In [10]:
sonSonuc= yarismaSonucu1 + yarismaSonucu2
sonSonuc

emre    110
eren     99
arda     13
dtype: int64

In [11]:
farkliSeries = pd.Series([20,30,40,50],["a","b","c","d"])
farkliSeries2 = pd.Series([10,20,30,40],["a","c","f","g"])

In [12]:
farkliSeries
farkliSeries2

farkliSeries+farkliSeries2

a    30.0
b     NaN
c    60.0
d     NaN
f     NaN
g     NaN
dtype: float64

DATAFRAME PANDAS

In [13]:
data = np.random.randn(4,3)
data

array([[-1.59336757,  1.76953736,  0.29449283],
       [ 0.64693105,  0.6478447 , -0.96276763],
       [-0.30865315, -1.24946469,  0.24805974],
       [ 1.45655519,  1.62276484,  0.28583153]])

In [14]:
dataFrame = pd.DataFrame(data)

In [15]:
dataFrame

          0         1         2
0 -1.593368  1.769537  0.294493
1  0.646931  0.647845 -0.962768
2 -0.308653 -1.249465  0.248060
3  1.456555  1.622765  0.285832

In [16]:
yeniDataFrame = pd.DataFrame(data,index=["emre","eren","arda","EEA"], columns=["maas","yas","calisma saati"])

In [17]:
yeniDataFrame

          maas       yas  calisma saati
emre -1.593368  1.769537       0.294493
eren  0.646931  0.647845      -0.962768
arda -0.308653 -1.249465       0.248060
EEA   1.456555  1.622765       0.285832

In [18]:
yeniDataFrame["yas"]
yeniDataFrame["calisma saati"]
yeniDataFrame[["maas","yas"]]

          maas       yas
emre -1.593368  1.769537
eren  0.646931  0.647845
arda -0.308653 -1.249465
EEA   1.456555  1.622765

In [19]:
yeniDataFrame.loc["emre"] #satir üstünde arama yapılmak istendiğinde "loc" parametresi kullanılır.

maas            -1.593368
yas              1.769537
calisma saati    0.294493
Name: emre, dtype: float64

In [20]:
yeniDataFrame.iloc[1] #satir işlemini index numarasını yazarak da yapılabilir.

maas             0.646931
yas              0.647845
calisma saati   -0.962768
Name: eren, dtype: float64

In [21]:
yeniDataFrame.loc[["emre"],"maas"]

emre   -1.593368
Name: maas, dtype: float64

In [22]:
yeniDataFrame["emeklilik Yasi"] = yeniDataFrame["yas"] + yeniDataFrame["yas"]

In [23]:
yeniDataFrame

          maas       yas  calisma saati  emeklilik Yasi
emre -1.593368  1.769537       0.294493        3.539075
eren  0.646931  0.647845      -0.962768        1.295689
arda -0.308653 -1.249465       0.248060       -2.498929
EEA   1.456555  1.622765       0.285832        3.245530

In [24]:
yeniDataFrame.drop("emeklilik Yasi", axis=1) # sütün silmek için kullanılacak parametre axis 1'dir

          maas       yas  calisma saati
emre -1.593368  1.769537       0.294493
eren  0.646931  0.647845      -0.962768
arda -0.308653 -1.249465       0.248060
EEA   1.456555  1.622765       0.285832

In [25]:
yeniDataFrame.drop("EEA", axis=0) #satir silmek için axis 0 kullanılır.

          maas       yas  calisma saati  emeklilik Yasi
emre -1.593368  1.769537       0.294493        3.539075
eren  0.646931  0.647845      -0.962768        1.295689
arda -0.308653 -1.249465       0.248060       -2.498929

In [26]:
yeniDataFrame.drop("emeklilik Yasi", axis=1, inplace= True) #inplace komutu, dataframe'den kalıcı olarak siler

In [27]:
yeniDataFrame

          maas       yas  calisma saati
emre -1.593368  1.769537       0.294493
eren  0.646931  0.647845      -0.962768
arda -0.308653 -1.249465       0.248060
EEA   1.456555  1.622765       0.285832

In [28]:
yeniDataFrame.loc[["emre"],"calisma saati"]

emre    0.294493
Name: calisma saati, dtype: float64

In [29]:
yeniDataFrame < 0

       maas    yas  calisma saati
emre   True  False          False
eren  False  False           True
arda   True   True          False
EEA   False  False          False

In [30]:
yeniDataFrame[yeniDataFrame <0]

          maas       yas  calisma saati
emre -1.593368       NaN            NaN
eren       NaN       NaN      -0.962768
arda -0.308653 -1.249465            NaN
EEA        NaN       NaN            NaN

In [31]:
yeniIndexListesi = ["e","e","a","eea"]

In [32]:
yeniDataFrame["Yeni Indeks"] = yeniIndexListesi

In [33]:
yeniDataFrame.set_index("Yeni Indeks") #isimler ile yeni eklenen index yerini
#değiştirir ama kalıcı değildir. kalıcı olması için
# inplace komutu kullanılması gerekir

                 maas       yas  calisma saati
Yeni Indeks
e           -1.593368  1.769537       0.294493
e            0.646931  0.647845      -0.962768
a           -0.308653 -1.249465       0.248060
eea          1.456555  1.622765       0.285832

MULTI INDEX KULLANIMI

In [34]:
ilkIndeksler = ["Simpson","Simpson","Simpson","South Park","South Park","South Park","South Park"]

In [35]:
icIndeksler = ["Homer", "Bart", "Marge","Cartman","Kenny","kyle"]

In [36]:
birlesmisIndeks = list(zip(ilkIndeksler,icIndeksler)) # birleştirme işlemi için zip komutu kullanılır.

In [37]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)

In [38]:
birlesmisIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'kyle')],
           )

In [39]:
benimCizgiFilmListem = [[40,"A"],[20,"B"],[48,"C"],[90,"D"],[17,"E"],[62,"F"]]

In [40]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [41]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi, index=birlesmisIndeks, columns=["yas","meslek"])

In [42]:
cizgiFilmDataFrame

                   yas meslek
Simpson    Homer    40      A
           Bart     20      B
           Marge    48      C
South Park Cartman  90      D
           Kenny    17      E
           kyle     62      F

In [43]:
cizgiFilmDataFrame.loc["Simpson"]

      yas meslek
Homer  40      A
Bart   20      B
Marge  48      C

In [44]:
cizgiFilmDataFrame.index.names = ["film adi","isim"]

In [45]:
cizgiFilmDataFrame

                   yas meslek
film adi   isim
Simpson    Homer    40      A
           Bart     20      B
           Marge    48      C
South Park Cartman  90      D
           Kenny    17      E
           kyle     62      F

GROUPBY

In [46]:
maasSozlugu = {"departman":["yazilim","satis","pazarlama","finans","insan kaynaklari","hukuk"],
               "calisan ismi": ["emre","eren","arda","EMRE","EREN","ARDA"],
               "maas": [100,150,200,300,400,500]
               }

In [47]:
maasDataFrame = pd.DataFrame(maasSozlugu)
maasDataFrame

          departman calisan ismi  maas
0           yazilim         emre   100
1             satis         eren   150
2         pazarlama         arda   200
3            finans         EMRE   300
4  insan kaynaklari         EREN   400
5             hukuk         ARDA   500

In [48]:
grupObjesi = maasDataFrame.groupby("departman")

In [49]:
grupObjesi.count()
grupObjesi.max()
grupObjesi.min()
grupObjesi.describe() #yapılması gerek bir çok işlemi bu parametre ile yapılabilir

                  maas
                 count   mean std    min    25%    50%    75%    max
departman
finans             1.0  300.0 NaN  300.0  300.0  300.0  300.0  300.0
hukuk              1.0  500.0 NaN  500.0  500.0  500.0  500.0  500.0
insan kaynaklari   1.0  400.0 NaN  400.0  400.0  400.0  400.0  400.0
pazarlama          1.0  200.0 NaN  200.0  200.0  200.0  200.0  200.0
satis              1.0  150.0 NaN  150.0  150.0  150.0  150.0  150.0
yazilim            1.0  100.0 NaN  100.0  100.0  100.0  100.0  100.0

CONCAT

In [50]:
sozluk1 = {"isim": ["emre","eren","arda"], 
           "spor": ["koşu","yüzme","kayak"],
           "kalori": [100,200,300]
           }

In [51]:
dataFrame1 = pd.DataFrame(sozluk1,index=[0,1,2])
dataFrame1

   isim   spor  kalori
0  emre   koşu     100
1  eren  yüzme     200
2  arda  kayak     300

In [52]:
sozluk2 = {"isim":["EMRE1","EREN1","ARDA1"],
           "spor": ["basketbol","futbol","yüzme"],
            "kalori": [599,140,120]
            }

In [53]:
sozluk2

{'isim': ['EMRE1', 'EREN1', 'ARDA1'],
 'spor': ['basketbol', 'futbol', 'yüzme'],
 'kalori': [599, 140, 120]}

In [54]:
dataframe2 = pd.DataFrame(sozluk2, index=[3,4,5])
dataframe2

    isim       spor  kalori
3  EMRE1  basketbol     599
4  EREN1     futbol     140
5  ARDA1      yüzme     120

In [55]:
pd.concat([dataFrame1,dataframe2]) #iki sozlugu birlestirmek icin kullanilir.
#"axis=1" parametresi kullanildigi zaman ise y ekseninde birlestirilir.

    isim       spor  kalori
0   emre       koşu     100
1   eren      yüzme     200
2   arda      kayak     300
3  EMRE1  basketbol     599
4  EREN1     futbol     140
5  ARDA1      yüzme     120

MERGE

In [56]:
mergeSozluk = {"isim":["emre2","eren2","arda2"],
           "spor": ["basketbol","futbol","yüzme"],
            }

In [57]:
mergesozluk2 = {"isim":["emre2","eren2","arda2"],
            "kalori": [599,140,120]
            }

In [58]:
mergeDataFrame2 = pd.DataFrame(mergesozluk2)
mergeDataFrame1 = pd.DataFrame(mergeSozluk)
pd.merge(mergeDataFrame1,mergeDataFrame2)
#2 tablo arasındaki farkli olan sütunu birlestiri.

    isim       spor  kalori
0  emre2  basketbol     599
1  eren2     futbol     140
2  arda2      yüzme     120

PANDAS'TA İLERİ OPERASYONLAR

In [59]:
maasSozluk = {"isim":["emre","eren","arda"],
            "departman": ["yazilim","satis","pazarlama"],
            "maas": [200,600,900]
            }

In [60]:
maasDataFrame = pd.DataFrame(maasSozluk)
maasDataFrame

   isim  departman  maas
0  emre    yazilim   200
1  eren      satis   600
2  arda  pazarlama   900

In [61]:
maasDataFrame["departman"].unique()
maasDataFrame["departman"].nunique()
maasDataFrame["departman"].value_counts()

departman
yazilim      1
satis        1
pazarlama    1
Name: count, dtype: int64

In [62]:
def bruttenNete(Maas):
    return Maas * 0.66

maasDataFrame["maas"].apply(bruttenNete) #fonksiyonları kullanmak için kullanılır

0    132.0
1    396.0
2    594.0
Name: maas, dtype: float64